// button reference here
const htmlBtn = document.getElementById("ch1");
const Click = new Audio("./audio/click.mp3");
const mainDiv = document.querySelector(".main-div");
const hiddenContainer = document.getElementById("hiddenDiv");
const submitButton = document.getElementById("submit-button");

htmlBtn.addEventListener("click", () => {
  Click.play();
  // timeZone.style.display = "block";
  mainDiv.style.opacity = "1";
  hiddenContainer.classList.add("show");
  submitButton.style.display = "block";
  let htmlApi = [
    {
      question: " দৈর্ঘ্যরে একক নির্ধারণে কার ভূমিকা রয়েছে?",
      a: "পানির",
      b: " লোহার",
      c: "আলোর",
      d: "তাপমাত্রার",
      ans: "ans3",
    },

    {
      question: "Q2:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "জুল",
      b: "কেলভিন",
      c: "নিউটন",
      d: "প্যাসকেল",
      ans: "ans2",
    },

    {
      question: "Q3:দীপন তীব্রতার একক কোনটি?",
      a: "কেলভিন",
      b: "ক্যান্ডেলা",
      c: "মোল",
      d: "জুল",
      ans: "ans2",
    },

    {
      question:
        "Q4: পদার্থবিজ্ঞানের মূল ভিত্তি কোন নীতিকে বলা হয়?",
      a: "শক্তির সংরক্ষণশীলতা নীতি",
      b: " বল বৃদ্ধিকরণ নীতি",
      c: "লিভারের নীতি",
      d: "ওপরের সবগুলো",
      ans: "ans1",
    },

    {
      question: "Q5: আলোর প্রতিসরণের সূত্র আবিষ্কার করেন কে?",
      a: " হাইগেন",
      b: 'রবার্ট হুক',
      c: 'স্নেল',
      d: 'ভন গুয়েরিক',
      ans: "ans3",
    },

    {
      question: "Q6:দৈর্ঘ্য মাপার সবচেয়ে সরল যন্ত্র কোনটি?",
      a: "ভার্নিয়ার স্কেল",
      b: "মিটার স্কেল",
      c: "স্ক্রু গজ",
      d: "স্লাইড ক্যালিপার্স",
      ans: "ans2",
    },

    {
      question: "Q7: স্ক্রু গজের সাহায্যে নিচের কোনটির ব্যাসার্ধ নির্ণয় করা যায়?",
      a: "বেলনের উচ্চতা",
      b: "তারের ব্যাসার্ধ",
      c: "ফাঁপা নলে অন্তঃব্যাস",
      d: "ফাঁপা নলের বহিঃব্যাস",
      ans: "ans4",
    },

    {
      question: "Q8:যদি ভার্নিয়ার স্কেলের ২০ ঘর প্রধান স্কেলের ক্ষুদ্রতম ১৯ ঘরের সমান হয়,তবে ভার্নিয়ার ধ্রুবক কত হবে?",
      a: ' 0.01 mm',
      b: "0.1 mm",
      c: '0.05 mm',
      d: '0.6 mm',
      ans: "ans3",
    },

    {
      question: "Q9: পদার্থ বিজ্ঞানকে প্রধানত কয়টি ভাগে ভাগ করা যায়?",
      a: "10",
      b: "9",
      c: "4",
      d: "3",
      ans: "ans1",
    },

    {
      question: "Q10 দৈর্ঘ্যরে একক নির্ধারণে কার ভূমিকা রয়েছে?",
      a: "পানির",
      b: " লোহার",
      c: "আলোর",
      d: "তাপমাত্রার",
      ans: "ans3",
    },

    {
      question: "Q11:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "জুল",
      b: "কেলভিন",
      c: "নিউটন",
      d: "প্যাসকেল",
      ans: "ans2",
    },

    {
      question: "Q12:দীপন তীব্রতার একক কোনটি?",
      a: "কেলভিন",
      b: "ক্যান্ডেলা",
      c: "মোল",
      d: "জুল",
      ans: "ans2",
    },

    {
      question:
        "Q13: পদার্থবিজ্ঞানের মূল ভিত্তি কোন নীতিকে বলা হয়?",
      a: "শক্তির সংরক্ষণশীলতা নীতি",
      b: " বল বৃদ্ধিকরণ নীতি",
      c: "লিভারের নীতি",
      d: "ওপরের সবগুলো",
      ans: "ans1",
    },

    {
      question: "Q14: আলোর প্রতিসরণের সূত্র আবিষ্কার করেন কে?",
      a: " হাইগেন",
      b: 'রবার্ট হুক',
      c: 'স্নেল',
      d: 'ভন গুয়েরিক',
      ans: "ans3",
    },

    {
      question: "Q15:দৈর্ঘ্য মাপার সবচেয়ে সরল যন্ত্র কোনটি?",
      a: "ভার্নিয়ার স্কেল",
      b: "মিটার স্কেল",
      c: "স্ক্রু গজ",
      d: "স্লাইড ক্যালিপার্স",
      ans: "ans2",
    },

    {
      question: "Q16: স্ক্রু গজের সাহায্যে নিচের কোনটির ব্যাসার্ধ নির্ণয় করা যায়?",
      a: "বেলনের উচ্চতা",
      b: "তারের ব্যাসার্ধ",
      c: "ফাঁপা নলে অন্তঃব্যাস",
      d: "ফাঁপা নলের বহিঃব্যাস",
      ans: "ans4",
    },

    {
      question: "Q17:যদি ভার্নিয়ার স্কেলের ২০ ঘর প্রধান স্কেলের ক্ষুদ্রতম ১৯ ঘরের সমান হয়,তবে ভার্নিয়ার ধ্রুবক কত হবে?",
      a: ' 0.01 mm',
      b: "0.1 mm",
      c: '0.05 mm',
      d: '0.6 mm',
      ans: "ans3",
    },

    {
      question: "Q18: পদার্থ বিজ্ঞানকে প্রধানত কয়টি ভাগে ভাগ করা যায়?",
      a: "10",
      b: "9",
      c: "4",
      d: "3",
      ans: "ans1",
    },


    {
      question: "Q19:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "পানির",
      b: " লোহার",
      c: "আলোর",
      d: "তাপমাত্রার",
      ans: "ans3",
    },

    {
      question: "Q20:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "জুল",
      b: "কেলভিন",
      c: "নিউটন",
      d: "প্যাসকেল",
      ans: "ans2",
    },

    {
      question: "Q21:দীপন তীব্রতার একক কোনটি?",
      a: "কেলভিন",
      b: "ক্যান্ডেলা",
      c: "মোল",
      d: "জুল",
      ans: "ans2",
    },

    {
      question:
        "Q22: পদার্থবিজ্ঞানের মূল ভিত্তি কোন নীতিকে বলা হয়?",
      a: "শক্তির সংরক্ষণশীলতা নীতি",
      b: " বল বৃদ্ধিকরণ নীতি",
      c: "লিভারের নীতি",
      d: "ওপরের সবগুলো",
      ans: "ans1",
    },

    {
      question: "Q23: আলোর প্রতিসরণের সূত্র আবিষ্কার করেন কে?",
      a: " হাইগেন",
      b: 'রবার্ট হুক',
      c: 'স্নেল',
      d: 'ভন গুয়েরিক',
      ans: "ans3",
    },

    {
      question: "Q24:দৈর্ঘ্য মাপার সবচেয়ে সরল যন্ত্র কোনটি?",
      a: "ভার্নিয়ার স্কেল",
      b: "মিটার স্কেল",
      c: "স্ক্রু গজ",
      d: "স্লাইড ক্যালিপার্স",
      ans: "ans2",
    },

    {
      question: "Q25: স্ক্রু গজের সাহায্যে নিচের কোনটির ব্যাসার্ধ নির্ণয় করা যায়?",
      a: "বেলনের উচ্চতা",
      b: "তারের ব্যাসার্ধ",
      c: "ফাঁপা নলে অন্তঃব্যাস",
      d: "ফাঁপা নলের বহিঃব্যাস",
      ans: "ans4",
    },

    {
      question: "Q26:যদি ভার্নিয়ার স্কেলের ২০ ঘর প্রধান স্কেলের ক্ষুদ্রতম ১৯ ঘরের সমান হয়,তবে ভার্নিয়ার ধ্রুবক কত হবে?",
      a: ' 0.01 mm',
      b: "0.1 mm",
      c: '0.05 mm',
      d: '0.6 mm',
      ans: "ans3",
    },

    {
      question: "Q27: পদার্থ বিজ্ঞানকে প্রধানত কয়টি ভাগে ভাগ করা যায়?",
      a: "10",
      b: "9",
      c: "4",
      d: "3",
      ans: "ans1",
    },

    {
      question: "Q28 দৈর্ঘ্যরে একক নির্ধারণে কার ভূমিকা রয়েছে?",
      a: "পানির",
      b: " লোহার",
      c: "আলোর",
      d: "তাপমাত্রার",
      ans: "ans3",
    },

    {
      question: "Q29:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "জুল",
      b: "কেলভিন",
      c: "নিউটন",
      d: "প্যাসকেল",
      ans: "ans2",
    },

    {
      question: "Q30:দীপন তীব্রতার একক কোনটি?",
      a: "কেলভিন",
      b: "ক্যান্ডেলা",
      c: "মোল",
      d: "জুল",
      ans: "ans2",
    },

    {
      question:
        "Q31: পদার্থবিজ্ঞানের মূল ভিত্তি কোন নীতিকে বলা হয়?",
      a: "শক্তির সংরক্ষণশীলতা নীতি",
      b: " বল বৃদ্ধিকরণ নীতি",
      c: "লিভারের নীতি",
      d: "ওপরের সবগুলো",
      ans: "ans1",
    },

    {
      question: "Q32: আলোর প্রতিসরণের সূত্র আবিষ্কার করেন কে?",
      a: " হাইগেন",
      b: 'রবার্ট হুক',
      c: 'স্নেল',
      d: 'ভন গুয়েরিক',
      ans: "ans3",
    },

    {
      question: "Q33:দৈর্ঘ্য মাপার সবচেয়ে সরল যন্ত্র কোনটি?",
      a: "ভার্নিয়ার স্কেল",
      b: "মিটার স্কেল",
      c: "স্ক্রু গজ",
      d: "স্লাইড ক্যালিপার্স",
      ans: "ans2",
    },

    {
      question: "Q34: স্ক্রু গজের সাহায্যে নিচের কোনটির ব্যাসার্ধ নির্ণয় করা যায়?",
      a: "বেলনের উচ্চতা",
      b: "তারের ব্যাসার্ধ",
      c: "ফাঁপা নলে অন্তঃব্যাস",
      d: "ফাঁপা নলের বহিঃব্যাস",
      ans: "ans4",
    },

    {
      question: "Q35:যদি ভার্নিয়ার স্কেলের ২০ ঘর প্রধান স্কেলের ক্ষুদ্রতম ১৯ ঘরের সমান হয়,তবে ভার্নিয়ার ধ্রুবক কত হবে?",
      a: ' 0.01 mm',
      b: "0.1 mm",
      c: '0.05 mm',
      d: '0.6 mm',
      ans: "ans3",
    },

    {
      question: "Q36: পদার্থ বিজ্ঞানকে প্রধানত কয়টি ভাগে ভাগ করা যায়?",
      a: "10",
      b: "9",
      c: "4",
      d: "3",
      ans: "ans1",
    },

    {
      question: "Q37:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "পানির",
      b: " লোহার",
      c: "আলোর",
      d: "তাপমাত্রার",
      ans: "ans3",
    },

    {
      question: "Q38:আন্তর্জাতিক পদ্ধতিতে তাপমাত্রার একক কী?",
      a: "জুল",
      b: "কেলভিন",
      c: "নিউটন",
      d: "প্যাসকেল",
      ans: "ans2",
    },

    {
      question: "Q39:দীপন তীব্রতার একক কোনটি?",
      a: "কেলভিন",
      b: "ক্যান্ডেলা",
      c: "মোল",
      d: "জুল",
      ans: "ans2",
    },

    {
      question:
        "Q40: পদার্থবিজ্ঞানের মূল ভিত্তি কোন নীতিকে বলা হয়?",
      a: "শক্তির সংরক্ষণশীলতা নীতি",
      b: " বল বৃদ্ধিকরণ নীতি",
      c: "লিভারের নীতি",
      d: "ওপরের সবগুলো",
      ans: "ans1",
    },

    
  ];

  createQuiz(htmlApi);
});
